Documents/бит_ЗаявлениеТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ЗаявлениеТСЖ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ЧленыТСЖ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацииЗаявлениеТСЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТСЖ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЧленовТСЖ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыхода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолосов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проживающий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ЧленыТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЧленыТСЖ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолосов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТСЖ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОперацииЗаявлениеТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацииЗаявлениеТСЖ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВступлениеВТСЖ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыходИзТСЖ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ЗаявлениеТСЖ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПодготовкаПараметровПроведенияДокумента

Функция ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
	
	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	бит_ЗаявлениеТСЖ.Ссылка КАК Регистратор,
	|	бит_ЗаявлениеТСЖ.Дата КАК Период,
	|	бит_ЗаявлениеТСЖ.ВидОперации,
	|	бит_ЗаявлениеТСЖ.ТСЖ
	|ИЗ
	|	Документ.бит_ЗаявлениеТСЖ КАК бит_ЗаявлениеТСЖ
	|ГДЕ
	|	бит_ЗаявлениеТСЖ.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + бит_ОбщегоНазначения.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТестЗапросаСписокЧленовТСЖ(НомераТаблиц)
	
	НомераТаблиц.Вставить("СписокЧленовТСЖ", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Регистратор,
	|	Док.Ссылка.Дата КАК Период,
	|	Док.Ссылка.ТСЖ,
	|	Док.НомерСтроки КАК НомерСтроки,
	|	Док.ЛицевойСчет,
	|	Док.Проживающий,
	|	Док.ДатаВступления,
	|	Док.ДатаВыхода,
	|	Док.КоличествоГолосов
	|ИЗ
	|	Документ.бит_ЗаявлениеТСЖ.СписокЧленовТСЖ КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + бит_ОбщегоНазначения.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	НомераТаблиц = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
		+ ТестЗапросаСписокЧленовТСЖ(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Процедура СформироватьДвижения_ЧленыТСЖ(ПараметрыПроведения, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	СписокЧленовТСЖ = ПараметрыПроведения.СписокЧленовТСЖ;
	
	Если СписокЧленовТСЖ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейДвижения = Движения.бит_ЧленыТСЖ;
	
	Для Каждого СтрокаТаблицы Из СписокЧленовТСЖ Цикл
		НоваяСтрока = НаборЗаписейДвижения.Добавить();
		НоваяСтрока.Период            = СтрокаТаблицы.Период;
		НоваяСтрока.ТСЖ               = СтрокаТаблицы.ТСЖ;
		НоваяСтрока.ЛицевойСчет       = СтрокаТаблицы.ЛицевойСчет;
		НоваяСтрока.ФизЛицо           = СтрокаТаблицы.Проживающий;
		НоваяСтрока.ДатаВступления    = СтрокаТаблицы.ДатаВступления;
		НоваяСтрока.ДатаВыхода        = СтрокаТаблицы.ДатаВыхода;
		НоваяСтрока.КоличествоГолосов = СтрокаТаблицы.КоличествоГолосов;
	КонецЦикла;
	
	НаборЗаписейДвижения.УстановитьАктивность(Истина);
	НаборЗаписейДвижения.Записывать = Истина;
	
КонецПроцедуры

Функция ПечатьДокумента(МассивОбъектов)Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Ссылка КАК Документ,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Ссылка.ТСЖ,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Ссылка.ВидОперации,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Ссылка.Дата КАК Период,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.ЛицевойСчет,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Проживающий,
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.ЛицевойСчет.Квартира КАК Квартира
	|ИЗ
	|	Документ.бит_ЗаявлениеТСЖ.СписокЧленовТСЖ КАК бит_ЗаявлениеТСЖСписокЧленовТСЖ
	|ГДЕ
	|	бит_ЗаявлениеТСЖСписокЧленовТСЖ.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Документ";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыПечачи = Новый Структура("Период, ТСЖ, Проживающий, Квартира, ЛицевойСчет");
		ЗаполнитьЗначенияСвойств(ПараметрыПечачи, Выборка);
		
		Если Выборка.ВидОперации = Перечисления.бит_ВидыОперацииЗаявлениеТСЖ.ВступлениеВТСЖ Тогда
			ТабличныйДокумент.Вывести(ПечатьЗаявленияНаВступление(ПараметрыПечачи));
		ИначеЕсли Выборка.ВидОперации = Перечисления.бит_ВидыОперацииЗаявлениеТСЖ.ВыходИзТСЖ Тогда
			ТабличныйДокумент.Вывести(ПечатьЗаявленияНаВвыход(ПараметрыПечачи));
		КонецЕсли;
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла; 
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьЗаявленияНаВступление(ПараметрыПечачи)
	
	Макет = ПолучитьМакет("МакетЗаявлениеНаВступление");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , ПараметрыПечачи.Период);
	Запрос.УстановитьПараметр("ЛицевойСчет", ПараметрыПечачи.ЛицевойСчет);
	Запрос.УстановитьПараметр("Проживающий", ПараметрыПечачи.Проживающий);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы КАК ПД,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.Наименование КАК ПДНазваниеДокумента,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.НомерДокумента КАК ПДНомерДокумента,
	|	бит_ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы.ДатаДокумента КАК ПДДатаДокумента
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Период,
	|			ФизЛицо = &Проживающий
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Период, ФизЛицо = &Проживающий) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ФИО = СокрЛП("" + СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + " " + СокрЛП(Выборка.Отчество));
	
	Если ПустаяСтрока(ФИО) Тогда
		ФИО = Строка(ПараметрыПечачи.Проживающий);
	КонецЕсли; 
	
	ФИОПроживающий = "";
	
	Попытка
		ИсходСклонения = бит_ПаспортныйСтолСервер.Просклонять(ФИО,2,ПараметрыПечачи.Проживающий.Пол,ФИОПроживающий);
	Исключение
		ИсходСклонения = Ложь;
	КонецПопытки;
	
	Если НЕ ИсходСклонения Тогда
		ФИОПроживающий = ФИО;
	КонецЕсли;
	
	ПДНаименование = "";
	
	Попытка
		ИсходСклонения = бит_ПаспортныйСтолСервер.Просклонять(Выборка.ПДНазваниеДокумента,2,,ПДНаименование);
	Исключение
		ИсходСклонения = Ложь;
	КонецПопытки;
	
	Если НЕ ИсходСклонения Тогда
		ПДНаименование = Выборка.ПДНазваниеДокумента;
	КонецЕсли;
	
	ПравоустанавливающиеДокументы = "" 
									+ ПДНаименование 
									+ ?(ЗначениеЗаполнено(Выборка.ПДНомерДокумента), " №" + Выборка.ПДНомерДокумента, "")
									+ ?(ЗначениеЗаполнено(Выборка.ПДДатаДокумента) , " от " + Формат(Выборка.ПДДатаДокумента, "ДФ=dd.MM.yyyy"), "");
	
	ОбластьШапка.Параметры.ТСЖ                            = ПараметрыПечачи.ТСЖ;
	ОбластьШапка.Параметры.Проживающий                    = ФИОПроживающий;
	ОбластьШапка.Параметры.Квартира                       = ПараметрыПечачи.Квартира;
	ОбластьШапка.Параметры.ПравоустанавливающиеДокументы  = ПравоустанавливающиеДокументы;
	ОбластьШапка.Параметры.Период                         = Формат(ПараметрыПечачи.Период, "ДФ='dd.MM.yyyy'") + " года."; 
	ОбластьШапка.Параметры.Подпись                        = ФИО + "_______________";
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьЗаявленияНаВвыход(ПараметрыПечачи)
	
	Макет = ПолучитьМакет("МакетЗаявлениеНаВыход");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , ПараметрыПечачи.Период);
	Запрос.УстановитьПараметр("Проживающий", ПараметрыПечачи.Проживающий);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество
	|ИЗ
	|	РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Период, ФизЛицо = &Проживающий) КАК бит_ФИОПроживающихСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ФИО = СокрЛП("" + СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + " " + СокрЛП(Выборка.Отчество));
	
	Если ПустаяСтрока(ФИО) Тогда
		ФИО = Строка(ПараметрыПечачи.Проживающий);
	КонецЕсли; 
	
	ФИОПроживающий = "";
	
	Попытка
		ИсходСклонения = бит_ПаспортныйСтолСервер.Просклонять(ФИО,2,ПараметрыПечачи.Проживающий.Пол,ФИОПроживающий);
	Исключение
		ИсходСклонения = Ложь;
	КонецПопытки;
	
	Если НЕ ИсходСклонения Тогда
		ФИОПроживающий = ФИО;
	КонецЕсли; 
	
	ОбластьШапка.Параметры.ТСЖ                            = ПараметрыПечачи.ТСЖ;
	ОбластьШапка.Параметры.Проживающий                    = ФИОПроживающий;
	ОбластьШапка.Параметры.Период                         = Формат(ПараметрыПечачи.Период, "ДФ='dd.MM.yyyy'") + " года."; 
	ОбластьШапка.Параметры.Подпись                        = Строка(ФИО) + "_______________";
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
